/*==============================================================================

     [bullet.h]
                                                       Author : Emu Saito
                                                       Date   : 2016/05/31
--------------------------------------------------------------------------------
    ■Update : None
==============================================================================*/

/*============================================================================
	インクルードガード(2重インクルード防止)
============================================================================*/
#ifndef _BULLET_H_
#define _BULLET_H_


/*============================================================================
	プロトタイプ宣言
============================================================================*/
void InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
int GetBullet(void);
void SetBullet(D3DXVECTOR3 pos,D3DXVECTOR3 Speed,float lifespan,D3DXCOLOR color);
void SetVertexBullet(int bulletIndex);




#endif _BULLET_H_